{
    "crags": [
        {
            "name": "Court Knowe Quarry",
            "rocktype": "Dolerite",
            "faces": "SW",
            "latitude": 55.81250,
            "longitude": -4.25472,
            "description": "Limited but enjoyable climbing.",
            "climbs": [
                {
                    "name": "Wullie's Crack",
                    "grade": "V1",
                    "description": "Good holds and polished footholds lead to a reach left to a thin crack then reach for the good ledges."
                },
                {
                    "name": "Blue Tit's Left Hand",
                    "grade": "V1",
                    "description": "The arete on the far left, taken from the leaning wall side. Gain arete from a sit start on jugs and layback up to midway ledge, then highstep to flat holds and step out right onto ledge."
                }
            ]
        },
        {
            "name": "Auchinstarry Quarry",
            "rocktype": "Dolerite",
            "faces": "S",
            "latitude": 55.96972,
            "longitude": -4.05389,
            "description": "Auchinstary is great. I've been there once with Joe and Alice. You can easily cycle there from Glasgow.",
            "climbs": [
                {
                    "name": "Scream",
                    "grade": "S 4b",
                    "description": "The crack gives interesting and well protected climbing."
                },
                {
                    "name": "Promontory Direct",
                    "grade": "V1",
                    "description": "Follow Blade Runner to the good ledge (top of the groove), then make a couple of awkward moves up the wall above. Step left and climb the prominent hand-crack, which is set in a little corner in its lower half."
                },
                {
                    "name": "Trundle",
                    "grade": "VS 4c",
                    "description": "Climb the obvious crack on the left hand side of the slab. Sustained climbing, fairly technical for 4c. Well protected, but placing gear may be awkward."
                }
            ]
        },
        {
            "name": "Super Quarry",
            "rocktype": "Dolerite",
            "faces": "S",
            "latitude": 55.890710,
            "longitude": -4.301584,
            "description": "It's not a real climbing spot. I just put it here to have more data on the map.",
            "climbs": [
                {
                    "name": "Scream",
                    "grade": "S 4b",
                    "description": "The crack gives interesting and well protected climbing."
                },
                {
                    "name": "Promontory Direct",
                    "grade": "V1",
                    "description": "Follow Blade Runner to the good ledge (top of the groove), then make a couple of awkward moves up the wall above. Step left and climb the prominent hand-crack, which is set in a little corner in its lower half."
                },
                {
                    "name": "Trundle",
                    "grade": "VS 4c",
                    "description": "Climb the obvious crack on the left hand side of the slab. Sustained climbing, fairly technical for 4c. Well protected, but placing gear may be awkward."
                }
            ]
        },
        {
            "name": "Neilston Quarry",
            "rocktype": "Dolerite",
            "faces": "W",
            "latitude": 55.77139,
            "longitude": -4.43417,
            "description": "An OK wee crag on summer's evening for bouldering, top roping or leading. Willie's Route (S) is good but a tad bold at the top for those new to leading. Punk Rock (HVS 5a) is a good technical route taking a steep pillar past an in-situ engineering nut. Fornication (VS) has a fair bit of loose rock so beware. Strawberry Crack is good but short.",
            "climbs": [
                {
                    "name": "Left and Left",
                    "grade": "S",
                    "description": "15m. On the far left side, the slab of rock directly ahead to the left when walking up from road by the path. Start from the lowest rock and head up in a diagonal line to left; this leads you through the slabs all the way up. Easier rock may be reached if you stray off line. Some loose rock,but generally sound. "
                },
                {
                    "name": "Right-Angled Corner",
                    "grade": "-",
                    "description": "No description."
                },
                {
                    "name": "Girdle Traverse",
                    "grade": "-",
                    "description": "Must have been done before now - Step onto the dark bouldering wall to the left and below Juggy crack and make way rightwards to end at base of Peg Leg - feet about between 1 and 2 meters off ground. A few entertaining blind moves but plenty of rests."
                },
                {
                    "name": "Peg Leg",
                    "grade": "HVS 5b",
                    "description": "2m. The once pegged crack on the extreme right of the Quarry. Also given f5+ as a Boulder problem."
                },
                {
                    "name": "Ally's Gash",
                    "grade": "f5+ / V2",
                    "description": "8m. Climb easily into the corner between Kirsteen's Crack and Polish Direct and move directly up over the overhang."
                }
            ]
        },
        {
            "name": "Slackdhu",
            "rocktype": "Dolerite",
            "faces": "SW",
            "latitude": 56.00508,
            "longitude": -4.31517,
            "description": "A quiet crag set in a spectacular position overlooking Glasgow and the Kilpatricks. The main escarpment is 100m high but exceptionally loose and grassy. Most of the climbing is on the square buttress at Jenny's Lum and offers low-grade routes of about 10m.",
            "climbs": [
                {
                    "name": "Maya",
                    "grade": "E1 5a",
                    "description": "Climbs direct the face immediately left of Jenny's Lum Arete. Blind climbing and badly protected, though escapable."
                },
                {
                    "name": "Jenny's Lum Arete",
                    "grade": "HS 4b",
                    "description": "Climbs the arete and obvious crack to the right."
                },
                {
                    "name": "The Writings on the Wall",
                    "grade": "E1 5b",
                    "description": "Eliminate face between the Jenny's Lum Arete and Tendons cracks. Bold without the cracks for gear."
                }
            ]
        }
    ]
}